DataProcessors/Дополнение_ТЗ_ПКД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>Дополнение_ТЗ_ПКД</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Enums/СостоянияЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СостоянияЗадач</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>БезИзмененияКП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнешнееСогласование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнешнийЗапрос</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратСВнешнегоДействия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРаботеКонструктора</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГлобальнаяПауза</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГлобальныйПровал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГлобальныйУспех</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДизайнерскийКонтроль</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗавершенаДизайнером</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗавершенаКонструктором</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗавершениеПроверкиВедущимКонструктором</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеКП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорректировкаДизайнер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжиданиеВнешнегоСогласования</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжиданиеКонструктором</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжиданиеПодтвержденияВедущимКонструктором</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжиданиеФиндиректором</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтложенаКонструктором</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отмена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаИзделия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриостановкаКонструктором</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Композиции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Композиции</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ГабаритныйЧертеж</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГабаритныеЧертежи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Конструктор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновноеПомещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Помещения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/Дополнение_ТЗ_ПКД/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Перем ТипДействияСтрокой, ИмяДействияДляФайла;

&НаКлиенте
Процедура ПроектПриИзменении(Элемент)
	
	ОбъектТЗ = ПредопределенноеЗначение("Справочник.Композиции.ПустаяСсылка");
	
	ЗадачиПКД.Очистить();
	ЗадачиРКД.Очистить();
	ВыбранноеЗначение = Неопределено;
	
	Если ЗначениеЗаполнено(Проект) Тогда
		СтруктураДанных = ПолучитьОбъектыПроекта(Проект);
		
		Для каждого Значение Из СтруктураДанных.ЗадачиПКД Цикл
			ЗаполнитьЗначенияСвойств(ЗадачиПКД.Добавить(), Значение);	
		КонецЦикла;
		
		Для каждого Значение Из СтруктураДанных.ЗадачиРКД Цикл
			ЗаполнитьЗначенияСвойств(ЗадачиРКД.Добавить(), Значение);	
		КонецЦикла;
		
	КонецЕсли;
	
    Элементы.ЗадачиПКД.Видимость = ЗадачиПКД.Количество() > 0;
    Элементы.ЗадачиРКД.Видимость = ЗадачиРКД.Количество() > 0;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьОбъектыПроекта(Проект)
	
	СтруктураДанных = Новый Структура("ЗадачиПКД, ЗадачиРКД, Производство", );

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВЫБОР
		|		КОГДА ИзделияКомплект.Родитель.Композиция = ЗНАЧЕНИЕ(Справочник.Композиции.ПустаяСсылка)
		|			ТОГДА ИзделияКомплект.Ссылка
		|		ИНАЧЕ ИзделияКомплект.Родитель.Композиция
		|	КОНЕЦ КАК Ссылка
		|ПОМЕСТИТЬ вт
		|ИЗ
		|	Справочник.ИзделияКомплект КАК ИзделияКомплект
		|ГДЕ
		|	НЕ ИзделияКомплект.ЭтоГруппа
		|	И ИзделияКомплект.Проект = &Проект
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	вт.Ссылка КАК ОбъектТЗ,
		|	Задачи_ПКД.Ссылка КАК Задача,
		|	ДанныеКомплектаСрезПоследних.ТекущаяСтадия.ПолноеНаименование КАК ТекущаяСтадия,
		|	ДанныеКомплектаСрезПоследних.Конструктор КАК Конструктор,
		|	Задачи_ПКД.ТипЗадачи КАК ТипЗадачи
		|ИЗ
		|	вт КАК вт
		|		ЛЕВОЕ СОЕДИНЕНИЕ Задача.Задачи_ПКД КАК Задачи_ПКД
		|		ПО вт.Ссылка = Задачи_ПКД.ОбъектТЗ
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеКомплекта.СрезПоследних КАК ДанныеКомплектаСрезПоследних
		|		ПО вт.Ссылка = ДанныеКомплектаСрезПоследних.Комплект
		|ГДЕ
		|	Задачи_ПКД.ТипЗадачи В(&ТипыЗадач)
		|	И НЕ Задачи_ПКД.Выполнена
		|
		|УПОРЯДОЧИТЬ ПО
		|	вт.Ссылка.Наименование
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	вт.Ссылка КАК ОбъектТЗ,
		|	Задачи_РКД.Ссылка КАК Задача,
		|	ДанныеКомплектаСрезПоследних.ТекущаяСтадия.ПолноеНаименование КАК ТекущаяСтадия,
		|	ДанныеКомплектаСрезПоследних.Конструктор КАК Конструктор,
		|	Задачи_РКД.ТипЗадачи КАК ТипЗадачи
		|ИЗ
		|	вт КАК вт
		|		ЛЕВОЕ СОЕДИНЕНИЕ Задача.Задачи_РКД КАК Задачи_РКД
		|		ПО вт.Ссылка = Задачи_РКД.ОбъектТЗ
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеКомплекта.СрезПоследних КАК ДанныеКомплектаСрезПоследних
		|		ПО вт.Ссылка = ДанныеКомплектаСрезПоследних.Комплект
		|ГДЕ
		|	Задачи_РКД.ТипЗадачи В(&ТипыЗадач)
		|	И НЕ Задачи_РКД.Выполнена
		|
		|УПОРЯДОЧИТЬ ПО
		|	вт.Ссылка.Наименование";
	
	ТипыЗадач = омЗадачиПКДПовтор.ТипыЗадачКонструктора(Ложь);
	
	Для каждого х Из омЗадачиПКДПовтор.ТипыЗадачКонструктораВедущий() Цикл
		ТипыЗадач.Добавить(х);
	КонецЦикла;
	
	Запрос.УстановитьПараметр("Проект", 	Проект);
	Запрос.УстановитьПараметр("ТипыЗадач", 	ТипыЗадач);
	
	Результат = Запрос.ВыполнитьПакет();
	СтруктураДанных.ЗадачиПКД = ОбщегоНазначения.ТаблицаЗначенийВМассив(Результат[1].Выгрузить());
	СтруктураДанных.ЗадачиРКД = ОбщегоНазначения.ТаблицаЗначенийВМассив(Результат[2].Выгрузить());
	 
	Возврат СтруктураДанных; 
	 
КонецФункции // ПолучитьОбъектыПроекта()

&НаКлиенте
Процедура ПослеЗакрытияВыбораФайла(Результат, ДополнительныеПараметры) Экспорт
	
	Если Открыта() Тогда
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры // ПослеЗакрытияВыбораФайла()

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ТипЗнч(Параметры) = Тип("ДанныеФормыСтруктура") И Параметры.Свойство("НаимеаниеДействия") Тогда
		НаимеаниеДействия = Параметры.НаимеаниеДействия;	
	КонецЕсли;
	
    Элементы.ЗадачиПКД.Видимость = Ложь;
    Элементы.ЗадачиРКД.Видимость = Ложь;
	
КонецПроцедуры


#Область БлокировкаТаблиц

&НаКлиенте
Процедура ЗадачиПКДПередНачаломИзменения(Элемент, Отказ)

	Отказ = Истина;
	
	ТД = Элементы.ЗадачиПКД.ТекущиеДанные;
	
	Если НЕ ТД = Неопределено Тогда
		ВыбранноеЗначение = ТД.Задача;	
		Элементы.ТребуетсяПересогласование.Видимость = Ложь;
		ТребуетсяПересогласование = Ложь;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗадачиПКДПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЗадачиПКДПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЗадачиРКДПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЗадачиРКДПередНачаломИзменения(Элемент, Отказ)

	Отказ = Истина;
	
	ТД = Элементы.ЗадачиРКД.ТекущиеДанные;
	
	Если НЕ ТД = Неопределено Тогда
		ВыбранноеЗначение = ТД.Задача;
		Элементы.ТребуетсяПересогласование.Видимость = Истина;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗадачиРКДПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

	
#КонецОбласти 

&НаКлиенте
Процедура ДобавитьИзменения(Команда)
	
	Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		
		ТекущиеСостояниеЗадачи = омЗадачиПКДСервер.ТекущиеСостояниеЗадачи(ВыбранноеЗначение).ТекущиеСостояние;
		
		Если ТекущиеСостояниеЗадачи = ПредопределенноеЗначение("Перечисление.СостоянияЗадач.ВРаботеКонструктора")
			ИЛИ ТекущиеСостояниеЗадачи = ПредопределенноеЗначение("Перечисление.СостоянияЗадач.ПриостановкаКонструктором") Тогда
			
			ТипДействияСтрокой = "";
			
		
		Иначе
		
			
		
		КонецЕсли;
		
		СтруктураДанных = Новый Структура("ВыбранноеЗначение", ВыбранноеЗначение);
		
		ОповещенияПослеЗакрытияВыбораФайла = Новый ОписаниеОповещения("ПослеЗакрытияВыбораФайла", ЭтаФорма);
		
		ПараметрыДоработки = Новый Структура("ОбъектДействий, ДействиеПриОкончании, НаименованиеДействия, ИмяДействияДляФайла"
		, ВыбранноеЗначение, ТипДействияСтрокой, "Перемещение файла в каталог PDM", ИмяДействияДляФайла);
		ОткрытьФорму("ОбщаяФорма.ФормаПереносИнформацииВPDM", ПараметрыДоработки, , , , , ОповещенияПослеЗакрытияВыбораФайла, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
		
	Иначе
		ПоказатьПредупреждение(, "Не выбрано значение");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если НаимеаниеДействия = "КорректировкаДизайнера" Тогда
		ЭтаФорма.Заголовок = "Корректировка Дизайнера";
		ТипДействияСтрокой = "КорректировкаДизайнер";
		ИмяДействияДляФайла = "Корректировка";
	Иначе
		ЭтаФорма.Заголовок = "Изменение Заказчиком";
		ТипДействияСтрокой = "РедакцияДизайнер";
		ИмяДействияДляФайла = "Редакция";
	КонецЕсли;
	
КонецПроцедуры
